In [ ]:
# pip install pandas

In [ ]:
import pandas as pd

In [ ]:
# most important object in NumPy??????
# ndarray

import numpy as np

a = np.array([]) # passing lists into arrays
type(a)

# we move one step ahead
# passing in dictionaries

In [ ]:
data = {
    'student': ['idrees','samson','carron','yaya'],
    'math': [35,45,46,32],
    'english': [45,36,41,np.nan]
}

# things called data frames in pandas
data

df = pd.DataFrame(data)
print(df)
type(df)

In [2]:
import pandas as pd

In [11]:
data = {

    "math" : 53,
    "english" : 43

}

type(data)

data2 = {

    "math" : [53,34,55],
    "english" : [43,34,66]

}

df1 = pd.DataFrame(data2, index=[3,4,4])

df1

   math  english
3    53       43
4    34       34
4    55       66

In [ ]:
import numpy as np

df = pd.DataFrame(np.array([1,2,3]), )

print(df)
type(df)

In [ ]:
df.head() # shows the first rows

dfstudent = df['math']
print(type(dfstudent))

dfstudentmean = df['math'].mean()
print(dfstudentmean)

In [ ]:
# I want you to create a dictionary 
# That saves 5 cities and temperature

temperatures =

In [ ]:
city = ("kuala lumpur","petaling jaya","shah alam","subang jaya","putrajaya")
 
trial = {
    city[0]: 32,
    city[1]: 25,          
    city[2]: 31,
    city[3]: 28,
    city[4]: 29
}
 
print(type(trial))

In [ ]:
import pandas as pd

df = pd.DataFrame(trial)

- python

- numpy : ndarray
    - np.array([])
    - maths calculations

- pandas : DataFrames, Series
    -

In [ ]:
students = {
    'name' : 'idrees',
    'rollno' :43,
    'address' : 'KL Jalan'
}

df = pd.DataFrame(students, index=[1,2,3])
df

         name  rollno   address
1 day  idrees      43  KL Jalan
2      idrees      43  KL Jalan
3      idrees      43  KL Jalan

In [29]:
city = {
    'KL' : [28,30,39],
    'NY' : [28,30,23],
    'BJ' : [28,44,17],
    'PA' : [34,30,39],
    'BK' : [22,30,19],
    'HK' : [28,22,39]
}


df = pd.DataFrame(city)
df

   KL  NY  BJ  PA  BK  HK
0  28  28  28  34  22  28
1  30  30  44  30  30  22
2  39  23  17  39  19  39

In [44]:
city['BJ'] = []
city
type(city['NY'])

list

In [ ]:
df['KL']
df['PA']

df['BK']
type(df['BK'])

pandas.core.series.Series

In [69]:
# dataframes, these are a combination of multiple series elements
# combination of multiple columns
# each column - as 1D dataframe - Series

seriesNum = pd.Series([1,2,3,4,5,6])
type(seriesNum)


seriesNames = pd.Series(["idrees","samson","hariz","balquis","yaya","fathul"])
type(seriesNames)

df = pd.DataFrame(seriesNum)
# dictionary, series, ndarray

print(df)

df['name'] = seriesNames

df["rollno"] = pd.Series([10,20,30,40,50,60])
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

   0     name  rollno
0  1   idrees      10
1  2   samson      20
2  3    hariz      30
3  4  balquis      40
4  5     yaya      50
5  6   fathul      60

In [70]:
df["averageIncome"] = pd.Series([1000000,2000000,3000000,4000000,5000000,6000000])
df

   0     name  rollno  averageIncome
0  1   idrees      10        1000000
1  2   samson      20        2000000
2  3    hariz      30        3000000
3  4  balquis      40        4000000
4  5     yaya      50        5000000
5  6   fathul      60        6000000

In [71]:
df['incomeMillions'] = df['averageIncome']/1000000
df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

In [80]:
df.to_csv('income.csv', index = False)

In [81]:
new_df = pd.read_csv('income.csv')
new_df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

In [148]:
dfr = pd.DataFrame([series1,series2,series3])
dfr

             0       1      2        3     4       5
0            1       2      3        4     5       6
name    idrees  samson  hariz  balquis  yaya  fathul
rollno      10      20     30       40    50      60

In [ ]:
# data frame is nothing but a combination of series objects

series1 = new_df['0']
series2 = new_df['name']
series3 = new_df['rollno']

dfx = pd.DataFrame(series2)

dfx['rollNo'] = series3
dfx

type(new_df['averageIncome'])
new_df['averageIncome']
new_df['incomeMillions']
new_df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

In [150]:
dft = new_df[['name','rollno','averageIncome']]
dft

      name  rollno  averageIncome
0   idrees      10        1000000
1   samson      20        2000000
2    hariz      30        3000000
3  balquis      40        4000000
4     yaya      50        5000000
5   fathul      60        6000000

In [125]:
iris = pd.read_csv('iris.csv',header=None)

# check your dataset
# head()  tail()


iris.head() # default 5
# iris.tail()

# iris.info()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [ ]:
iris[4].unique()

# stores data of 3 species of flower

# data -----> algorithm = Trained Model

# input(0,1,2,3) ----> Trained Model -----> specie(s,v,v) === better results

# input(0,1,2,3) , 4, 5, 6 ----> Trained Model2 -----> specie(s,v,v) === better results

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [134]:
iris[4].duplicated()

0      False
1       True
2       True
3       True
4       True
       ...
145     True
146     True
147     True
148     True
149     True
Name: 4, Length: 150, dtype: bool

In [136]:
iris[4].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [137]:
iris[4].value_counts()

4
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [151]:
df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

axis = 0 --- >

axis = 1 ---->

In [162]:
dfd = df.drop(0,axis=1) # row at 0 index was removed
dfd

      name  rollno  averageIncome  incomeMillions
0   idrees      10        1000000             1.0
1   samson      20        2000000             2.0
2    hariz      30        3000000             3.0
3  balquis      40        4000000             4.0
4     yaya      50        5000000             5.0
5   fathul      60        6000000             6.0

In [167]:
dfd = df.drop(['name',0],axis=1) # column named name was removed
dfd

   rollno  averageIncome  incomeMillions
0      10        1000000             1.0
1      20        2000000             2.0
2      30        3000000             3.0
3      40        4000000             4.0
4      50        5000000             5.0
5      60        6000000             6.0

In [169]:
iris_without_species = iris.drop(4, axis = 1)
iris_without_species

       0    1    2    3
0    5.1  3.5  1.4  0.2
1    4.9  3.0  1.4  0.2
2    4.7  3.2  1.3  0.2
3    4.6  3.1  1.5  0.2
4    5.0  3.6  1.4  0.2
..   ...  ...  ...  ...
145  6.7  3.0  5.2  2.3
146  6.3  2.5  5.0  1.9
147  6.5  3.0  5.2  2.0
148  6.2  3.4  5.4  2.3
149  5.9  3.0  5.1  1.8

[150 rows x 4 columns]

In [171]:
species = iris.drop([0,1,2,3], axis= 1)
species

                  4
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 1 columns]

In [186]:
iris2 = iris_without_species
iris2['species'] = species
iris2

       0    1    2    3         species
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]